export type ILesson = {
  type: string;
  time: string;
  subgroup: string;
  name: string;
  place: string;
  office: string;
  groups?: number[];
  dates?: string[];
};

export type Idays = {
  number: string;
  countLessons: string;
  timeLessons: string;
  week: string;
  lessons: ILesson[];
};

export const days = [
  {
    number: "3 ноября, пт",
    countLessons: "4",
    timeLessons: "8:00 -- 15:00",
    week: "четная неделя",
    lessons: [
      {
        type: "лабораторная работа",
        time: "8:00",
        subgroup: "1 подгруппа",
        name: "Основы конструкторского проектирования интеллектуальных технических систем",
        place: "3 здание",
        office: "264",
      },
      {
        type: "лабораторная работа",
        time: "8:00",
        subgroup: "1 подгруппа",
        name: "Основы конструкторского проектирования интеллектуальных технических систем",
        place: "3 здание",
        office: "264",
      },
      {
        type: "Лекция",
        time: "8:00",
        subgroup: "1 подгруппа",
        name: "Основы конструкторского проектирования интеллектуальных технических систем",
        place: "3 здание",
        office: "264",
        groups: [4315, 4314, 4313],
      },
      {
        type: "лабораторная работа",
        time: "8:00",
        subgroup: "1 подгруппа",
        name: "Основы конструкторского проектирования интеллектуальных технических систем",
        place: "3 здание",
        office: "264",
      },
    ],
  },
  {
    number: "3 ноября, пт",
    countLessons: "4",
    timeLessons: "8:00 -- 15:00",
    week: "четная неделя",
    lessons: [
      {
        type: "лабораторная работа",
        time: "8:00",
        subgroup: "1 подгруппа",
        name: "Основы конструкторского проектирования интеллектуальных технических систем",
        place: "3 здание",
        office: "264",
      },
      {
        type: "лабораторная работа",
        time: "8:00",
        subgroup: "1 подгруппа",
        name: "Основы конструкторского проектирования интеллектуальных технических систем",
        place: "3 здание",
        office: "264",
        dates: ["03.09", "03.22", "04.03", "04.09", "05.10", "04.09", "05.10"],
      },
      {
        type: "лабораторная работа",
        time: "8:00",
        subgroup: "1 подгруппа",
        name: "Основы конструкторского проектирования интеллектуальных технических систем",
        place: "3 здание",
        office: "264",
      },
    ],
  },
  {
    number: "3 ноября, пт",
    countLessons: "4",
    timeLessons: "8:00 -- 15:00",
    week: "четная неделя",
    lessons: [
      {
        type: "лабораторная работа",
        time: "8:00",
        subgroup: "1 подгруппа",
        name: "Основы конструкторского проектирования интеллектуальных технических систем",
        place: "3 здание",
        office: "264",
      },
      {
        type: "лабораторная работа",
        time: "8:00",
        subgroup: "1 подгруппа",
        name: "Основы конструкторского проектирования интеллектуальных технических систем",
        place: "3 здание",
        office: "264",
      },
    ],
  },
  {
    number: "3 ноября, пт",
    countLessons: "4",
    timeLessons: "8:00 -- 15:00",
    week: "четная неделя",
    lessons: [
      {
        type: "лабораторная работа",
        time: "8:00",
        subgroup: "1 подгруппа",
        name: "Основы конструкторского проектирования интеллектуальных технических систем",
        place: "3 здание",
        office: "264",
      },
    ],
  },
];
